src/cf/maERP_ib/src/Catalogs/НомераГТД/НомераГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НомераГТД</name>
  <attributes>
    <name>ПорядковыйНомерТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>23</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаВвозаНеРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/maERP_ib/src/Catalogs/НомераГТД/Forms/ФормаЭлемента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РегНомер = РегистрационныйНомер(Объект.Код);	
	КодОшибки = РегНомер.КодОшибки;	
	УправлениеПодсказками(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = Не НомерСоответствуетФормату();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	НомерСоответствуетФормату();	
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Функция НомерСоответствуетФормату()
	Реквизиты = РегистрационныйНомер(Объект.Код);
	Объект.РегистрационныйНомер = Реквизиты.РегистрационныйНомер;
	Объект.ПорядковыйНомерТовара = Реквизиты.ПорядковыйНомерТовара;
	Объект.СтранаВвозаНеРФ = Реквизиты.СтранаВвозаНеРФ;
	КодОшибки = Реквизиты.КодОшибки;		
	УправлениеПодсказками(ЭтотОбъект);
	Возврат КодОшибки = 0;
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция РегистрационныйНомер(Знач НомерТаможеннойДекларации)
	НомерДекларацииНаТовары = СокрЛП(НомерТаможеннойДекларации);
	Результат = Новый Структура("РегистрационныйНомер, ПорядковыйНомерТовара, СтранаВвозаНеРФ, КодОшибки", "", "", Истина, 0);
	// Получаем корректный период декларации
	НачалоКорректногоПериода = Дата(2000, 1, 1);
	КонецКорректногоПериода = ДобавитьМесяц(КонецГода(ТекущаяДата()), 9 * 12);
	// Проверка длины номера
	Если СтрДлина(НомерДекларацииНаТовары) < 23 Или СтрДлина(НомерДекларацииНаТовары) > 28 Тогда
		Результат.КодОшибки = 9;
		Возврат Результат;
	КонецЕсли;
	// Разбираем по элементам
	МассивТД = СтрРазделить(НомерДекларацииНаТовары, "/"); 	
	// Количество элементов
	Если МассивТД.Количество() > 4 Или МассивТД.Количество() < 3 Тогда // Номер декларации на товары указан с ошибками.
		Результат.КодОшибки = 1;
		Возврат Результат;
	КонецЕсли;
	// Код ПТО
	КодТаможенногоОргана = МассивТД[0];	
	Если СтрДлина(КодТаможенногоОргана) <> 2 и СтрДлина(КодТаможенногоОргана) <> 5 и СтрДлина(КодТаможенногоОргана) <> 8 Тогда // Ошибочная длина кода таможенного органа
		Результат.КодОшибки = 2;
		Возврат Результат;
	КонецЕсли;	
	// Дата декларации
	ДатаПринятияДекларацииНаТовары = МассивТД[1];	
	Если СтрДлина(ДатаПринятияДекларацииНаТовары) <> 6 Тогда
		Результат.КодОшибки = 3;
		Возврат Результат;
	Иначе
		Если Не ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(ДатаПринятияДекларацииНаТовары) Тогда // Длина поля верная, но дата указана ошибочно
			Результат.КодОшибки = 3;
			Возврат Результат;
		КонецЕсли;
		СтрокаВДату = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаПринятияДекларацииНаТовары);
		Если Не ЗначениеЗаполнено(СтрокаВДату) Тогда // Длина поля верная, но дата указана ошибочно
			Результат.КодОшибки = 3;
			Возврат Результат;
		Иначе
			// Проверим год на корректность указания.			
			Если СтрокаВДату < НачалоКорректногоПериода Или СтрокаВДату > КонецКорректногоПериода Тогда
				Результат.КодОшибки = 4;
				Возврат Результат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	// Порядковый номер декларации
	ПорядковыйНомерДекларацииНаТовары = МассивТД[2];
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) < 7 Или СтрДлина(ПорядковыйНомерДекларацииНаТовары) > 8 Тогда // Ошибочная длина поля порядковый номер
		Результат.КодОшибки = 5;
		Возврат Результат;
	КонецЕсли;
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) = 7 Тогда
		ПервыйСимвол = ВРег(Лев(ПорядковыйНомерДекларацииНаТовары, 1));
		Если (ПервыйСимвол = "В" Или ПервыйСимвол = "B") Тогда
			Если Не ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(Прав(ПорядковыйНомерДекларацииНаТовары, 6)) Тогда // Ошибочный формат поля порядковый номер
				Результат.КодОшибки = 5;
				Возврат Результат;
			КонецЕсли;
		Иначе
			Если Не ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(ПорядковыйНомерДекларацииНаТовары) Тогда // Ошибочный формат поля порядковый номер
				Результат.КодОшибки = 5;
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) = 8 Тогда
		ПервыеДваСимвола = ВРег(Лев(ПорядковыйНомерДекларацииНаТовары, 2));
		Если ПервыеДваСимвола = "0Б" Тогда // Вместо буквы "О" указана цифра ноль
			Результат.КодОшибки = 6;
			Возврат Результат;
		ИначеЕсли ПервыеДваСимвола = "3В" Или ПервыеДваСимвола = "3B" Тогда // Вместо буквы "З" указана цифра три
			Результат.КодОшибки = 7;
			Возврат Результат;
		ИначеЕсли ПервыеДваСимвола <> "ОБ" И ПервыеДваСимвола <> "OБ" И ПервыеДваСимвола <> "ЗВ" И ПервыеДваСимвола <> "ЗB" Тогда // Ошибочный формат поля порядковый номер			
			Результат.КодОшибки = 5;
			Возврат Результат;
		КонецЕсли;
		ПоследниеШестьСимволов = ВРег(Прав(ПорядковыйНомерДекларацииНаТовары, 6));
		Если Не ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеШестьСимволов) Тогда // Ошибочный формат поля порядковый номер			
			Результат.КодОшибки = 5;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	// Порядковый номер товара в тдекларации
	Если МассивТД.Количество() = 4 Тогда
		ПорядковыйНомерТовара = МассивТД[3];
		Если СтрДлина(ПорядковыйНомерТовара) > 3 Или СтрДлина(ПорядковыйНомерТовара) < 1 Тогда // Ошибочная длина поля порядковый номер товара			
			Результат.КодОшибки = 8;
			Возврат Результат;
		КонецЕсли;
		Результат.ПорядковыйНомерТовара = ПорядковыйНомерТовара;
		МассивТД.Удалить(3);
	КонецЕсли;
	// Формируем регистрационный номер	
	Результат.РегистрационныйНомер = СтрСоединить(МассивТД, "/");
	Результат.СтранаВвозаНеРФ = Ложь;
	Возврат Результат;	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеПодсказками(Форма)
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;	
	Элементы.НомерОшибочнаяСтруктура.Видимость      = Форма.КодОшибки = 1;
	Элементы.КодТаможенногоОрганаДлина.Видимость    = Форма.КодОшибки = 2;
	Элементы.ДатаДекларацииДлина.Видимость          = Форма.КодОшибки = 3;
	Элементы.ДатаДекларацииОшибочная.Видимость      = Форма.КодОшибки = 4;
	Элементы.ПорядковыйНомерДлина.Видимость         = Форма.КодОшибки = 5;
	Элементы.ПорядковыйЦифра0ВместоБуквыО.Видимость = Форма.КодОшибки = 6;
	Элементы.ПорядковыйЦифра3ВместоБуквыЗ.Видимость = Форма.КодОшибки = 7;
	Элементы.ПорядковыйНомерТовараДлина.Видимость   = Форма.КодОшибки = 8;
	Элементы.НомерНевернаяДлина.Видимость   		= Форма.КодОшибки = 9;
КонецПроцедуры

#КонецОбласти
